src/DataProcessors/рмкКонсольОтладки/рмкКонсольОтладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рмкКонсольОтладки</name>
</mdclass:DataProcessor>

src/Catalogs/рмкВходящиеСообщения/рмкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкВходящиеСообщения</name>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСериализации</name>
    <type>
      <types>EnumRef.рмкСпособыСериализации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетодаСериализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/рмкКонсольОтладки/Forms/Form/Module.bsl
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	ОтправитьСообщение(ИсходящееСообщение);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение)
	
	// получаем сообщения
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("Сообщение");
	ТаблицаСообщений.Колонки.Добавить("Сервер");
	ТаблицаСообщений.Колонки.Добавить("ВиртуальныйХост");
	ТаблицаСообщений.Колонки.Добавить("УниверсальнаяДатаСоздания");
	
	СтрокаСообщения = ТаблицаСообщений.Добавить();
	СтрокаСообщения.Сообщение = Сообщение;
	СтрокаСообщения.Сервер = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "Сервер");
	СтрокаСообщения.ВиртуальныйХост = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "ВиртуальныйХост");
	СтрокаСообщения.УниверсальнаяДатаСоздания = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "УниверсальнаяДатаСоздания");
	
	ОтправитьСообщения(ТаблицаСообщений);
	
КонецПроцедуры

// таблица сообщений должна содержать колонки
// сообщение (ссылка), сервер, виртуальный хост, универсальная дата создания
Процедура ОтправитьСообщения(ТаблицаСообщений)
	
	ТаблицаСообщений.Сортировать("Сервер,ВиртуальныйХост,УниверсальнаяДатаСоздания");
	ТаблицаХостов = ТаблицаСообщений.Скопировать();
	ТаблицаХостов.Свернуть("Сервер,ВиртуальныйХост");
	Отбор = Новый Структура("Сервер,ВиртуальныйХост");
	
	Коннектор = Обработки.рмкКоннектор.Создать();
	Коннектор.Инициализировать();
	
	// в цикле устанавливаем соединения
	Для Каждого СтрокаХоста Из ТаблицаХостов Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаХоста);
		СообщенияКОтправке = ТаблицаСообщений.НайтиСтроки(Отбор);

		Коннектор.Подключиться(СтрокаХоста.ВиртуальныйХост);
		
		Для Каждого СтрокаСообщения Из СообщенияКОтправке Цикл
			
			Коннектор.ОтправитьСообщение(СтрокаСообщения.Сообщение);
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Коннектор.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияИзОчередиНаСервере()
	
	Коннектор = Обработки.рмкКоннектор.Создать();
	Коннектор.Инициализировать();
	Коннектор.Подключиться(СлушательОчереди.ВиртуальныйХост);
	Коннектор.ПолучитьСообщенияИзОчереди(СлушательОчереди); 
	Коннектор.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияИзОчереди(Команда)
	
	ПолучитьСообщенияИзОчередиНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура РазобратьВходящиеСообщения(Команда)
	РазобратьВходящиеСообщенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазобратьВходящиеСообщенияНаСервере()
	

	ВходящиеСообщения = ПолучитьВходящиеСообщения();
	рмкОбработкаСообщений.ОбработатьВходящиеСообщения(ВходящиеСообщения);
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьВходящиеСообщения() Экспорт
	
	ВходящиеСообщения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рмкВходящиеСообщения.Ссылка
	|ИЗ
	|	Справочник.рмкВходящиеСообщения КАК рмкВходящиеСообщения";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВходящиеСообщения.Добавить(Выборка.Ссылка);
	КонецЦикла;	
		
	Возврат ВходящиеСообщения;
	
КонецФункции
